//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
        // Задание 1 Программа выводит значение 33. Т.К в метод мы передаем копии примитивов.
        //Задание 2 Программа выводит значение 33. Т.К в методе переменной value мы задаем новое значение и меняется сама ссылка, т.к метод ничего не возвращает
        // Задание 3 Программа выводит значение {3, 4}.Т.К. в методе мы создали новый объект у которого изменится ссылка.
        // Задание 4 Программа выводит значение [99, 4], т.к. мы можем изменить значение под индексом 0, а сам массив изменить нельзя.
        // Задание 5 Программа выводит значение Fedor Dostoevskiy, т.к в методе мы создаем новый объект
        // Задание 6 Программа выводит значение Lev Tolstoy, т.к мы меняем поля объекта

    }


}